Plasmarobo/HexCellMkII/bsp/stm32f103c8tx/Core/Src/spi.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    spi.c
  * @brief   This file provides code for the configuration
  *          of the SPI instances.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/

#include "stm32f1xx_hal.h"
#ifdef HAL_SPI_MODULE_ENABLED
#include "spi.h"

/* USER CODE BEGIN 0 */
#include "bsp.h"
#include "gpio.h"
#include "opt_prototypes.h"
#include "stm32f1xx_it.h"

static opt_callback_t operation_callback;
/* USER CODE END 0 */

SPI_HandleTypeDef hspi1;

/* SPI1 init function */
void MX_SPI1_Init(void)
{

  /* USER CODE BEGIN SPI1_Init 0 */

  /* USER CODE END SPI1_Init 0 */

  /* USER CODE BEGIN SPI1_Init 1 */

  /* USER CODE END SPI1_Init 1 */
  hspi1.Instance = SPI1;
  hspi1.Init.Mode = SPI_MODE_MASTER;
  hspi1.Init.Direction = SPI_DIRECTION_2LINES;
  hspi1.Init.DataSize = SPI_DATASIZE_8BIT;
  hspi1.Init.CLKPolarity = SPI_POLARITY_LOW;
  hspi1.Init.CLKPhase = SPI_PHASE_1EDGE;
  hspi1.Init.NSS = SPI_NSS_SOFT;
  hspi1.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_16;
  hspi1.Init.FirstBit = SPI_FIRSTBIT_MSB;
  hspi1.Init.TIMode = SPI_TIMODE_DISABLE;
  hspi1.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
  hspi1.Init.CRCPolynomial = 10;
  if (HAL_SPI_Init(&hspi1) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN SPI1_Init 2 */

  /* USER CODE END SPI1_Init 2 */

}

void HAL_SPI_MspInit(SPI_HandleTypeDef* spiHandle)
{

  GPIO_InitTypeDef GPIO_InitStruct = {0};
  if(spiHandle->Instance==SPI1)
  {
  /* USER CODE BEGIN SPI1_MspInit 0 */

  /* USER CODE END SPI1_MspInit 0 */
    /* SPI1 clock enable */
    __HAL_RCC_SPI1_CLK_ENABLE();

    __HAL_RCC_GPIOB_CLK_ENABLE();
    /**SPI1 GPIO Configuration
    PB3     ------> SPI1_SCK
    PB5     ------> SPI1_MOSI
    */
    GPIO_InitStruct.Pin = LED_CLK_Pin|LED_DATA_Pin;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    __HAL_AFIO_REMAP_SPI1_ENABLE();

    /* SPI1 interrupt Init */
    HAL_NVIC_SetPriority(SPI1_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(SPI1_IRQn);
    /* USER CODE BEGIN SPI1_MspInit 1 */

    /* USER CODE END SPI1_MspInit 1 */
  }
}

void HAL_SPI_MspDeInit(SPI_HandleTypeDef* spiHandle)
{

  if(spiHandle->Instance==SPI1)
  {
  /* USER CODE BEGIN SPI1_MspDeInit 0 */

  /* USER CODE END SPI1_MspDeInit 0 */
    /* Peripheral clock disable */
    __HAL_RCC_SPI1_CLK_DISABLE();

    /**SPI1 GPIO Configuration
    PB3     ------> SPI1_SCK
    PB5     ------> SPI1_MOSI
    */
    HAL_GPIO_DeInit(GPIOB, LED_CLK_Pin|LED_DATA_Pin);

    /* SPI1 interrupt Deinit */
    HAL_NVIC_DisableIRQ(SPI1_IRQn);
    /* USER CODE BEGIN SPI1_MspDeInit 1 */

    /* USER CODE END SPI1_MspDeInit 1 */
  }
}

/* USER CODE BEGIN 1 */

void spi_send(uint8_t* buffer, uint32_t length, opt_callback_t cb)
{
  uint32_t prim;
  operation_callback = cb;

  prim = __get_PRIMASK();
  __disable_irq();
  /*
  if (HAL_OK != HAL_SPI_Transmit_IT(&hspi1, buffer, length))
  {
    if (NULL != cb)
    {
      cb(SPI_ERROR, 0);
    }
  }
  */
  if (HAL_OK != HAL_SPI_Transmit(&hspi1, buffer, length, 1000))
  {
    if (NULL != cb)
    {
      cb(SPI_ERROR, 0);
    }
  }
  else
  {
    if (NULL != cb)
    {
      cb(SPI_SUCCESS, 0);
    }
  }
  if (!prim)
  {
    __enable_irq();
  }
}

void HAL_SPI_TxCpltCallback(SPI_HandleTypeDef* hspi)
{
  if (hspi == &hspi1)
  {
    if (NULL != operation_callback)
    {
      operation_callback(SPI_SUCCESS, 0);
    }
  }
}

void HAL_SPI_RxCpltCallback(SPI_HandleTypeDef* hspi)
{
  if (hspi == &hspi1)
  {
    if (NULL != operation_callback)
    {
      operation_callback(SPI_SUCCESS, 0);
    }
  }
}

void HAL_SPI_TxRxCpltCallback(SPI_HandleTypeDef* hspi)
{
  if (hspi == &hspi1)
  {
    if (NULL != operation_callback)
    {
      operation_callback(SPI_SUCCESS, 0);
    }
  }
}
/* USER CODE END 1 */
#endif